backend/app/models/drawing.rb

    def user_attributes=(user_attributes)
        user = User.find_or_create_by(user_attributes)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Byron"], ["created_at", "2021-01-31 19:36:34.987765"], ["updated_at", "2021-01-31 19:36:34.987765"]]