backend/app/controllers/drawings_controller.rb

    def index
        drawings = Drawing.all
---
SELECT "drawings".* FROM "drawings"

    def create
        drawing = Drawing.new(drawing_params)
        if drawing.save
---
INSERT INTO "drawings" ("pattern", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pattern", "--- '[\"1\",\"2\",\"3\"]'\n"], ["user_id", 2], ["created_at", "2021-01-28 18:47:29.632256"], ["updated_at", "2021-01-28 18:47:29.632256"]]

    def update
        if drawing.update(drawing_params)
---
UPDATE "drawings" SET "title" = ?, "pattern" = ?, "updated_at" = ? WHERE "drawings"."id" = ?

    def destroy
        drawing.destroy
---
DELETE FROM "drawings" WHERE "drawings"."id" = ?  [["id", 9]]

    def find_drawing
        drawing = Drawing.find_by_id(params[:id])
---
SELECT "drawings".* FROM "drawings" WHERE "drawings"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]