backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Drew"], ["created_at", "2021-01-28 18:36:10.298978"], ["updated_at", "2021-01-28 18:36:10.298978"]]
---
    def create
        user = User.new(user_params)
        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_user
        user = User.find_by_id(params[:id])